In [3]:
# Pandas Data Science Library

import pandas as pd
import numpy as np
print (pd.__version__)

2.3.3

In [9]:
# Pandas Series 
# Series is 1D Labelled Array

s = pd.Series([10,20,30,40,50],dtype='int32')
print(type(s))
print(s)

# numpy array only holds numbers
# pandas Series can hold numbers + labels(index)

<class 'pandas.core.series.Series'>
0    10
1    20
2    30
3    40
4    50
dtype: int32

In [12]:
info = pd.Series(['Jia',21,'Tourism','Perak'],index=['name','age','course','city'])
print(info)
print(info['name'])

name          Jia
age            21
course    Tourism
city        Perak
dtype: object
Jia

In [14]:
info = pd.Series(['Jia',21,'Tourism','Perak'],index=['name','age','course','city'])
print(info)
print(info['name'])        # Indexing Method
print(info.get('age'))     # get() method
print(info.iloc[3])        # iloc -----> indexs location

# Series is somewhat a combination of dictionary + array.

name          Jia
age            21
course    Tourism
city        Perak
dtype: object
Jia
21
Perak

In [21]:
# values property
# prints only the values 

print(info.values)
print(info.values[2])

['Jia' 21 'Tourism' 'Perak']
Tourism

In [73]:
# indexing Slicing and loops for Series

s = pd.Series([100,200,300,400,500,600],index=['v1','v2','v3','v4','v5','v6'])
print(s)
 
# 100  200   300   400    500     600
# 0     1     2     3      4       5
# -6    -5    -4    -3     -2      -1
# v1     v2   v3     v4    v5      v6
 
# Indexing in Series can be done by using [] or iloc[] or loc[]
print('\nIndexing In Series')
print(s.iloc[5])    # for index numbers
print(s.loc['v2'])  # loc used for labels
print(s['v3'])      # [] used for labels
print(s.iloc[-6])  

print('\nSlicing in Series')
print(s[0:3])
print(s['v1':'v5'])

# print 100, 400, 600
print(f'\n''Printing specific values')
print(s[['v1','v4','v6']])
print(s[['v1','v4','v6']].values)

# Conditional Selection
print(f'\n''Condition Selection')
print(s[s%4==0])

v1    100
v2    200
v3    300
v4    400
v5    500
v6    600
dtype: int64

Indexing In Series
600
200
300
100

Slicing in Series
v1    100
v2    200
v3    300
dtype: int64
v1    100
v2    200
v3    300
v4    400
v5    500
dtype: int64

Printing specific values
v1    100
v4    400
v6    600
dtype: int64
[100 400 600]

Condition Selection
v1    100
v2    200
v3    300
v4    400
v5    500
v6    600
dtype: int64

In [72]:
# For loops in Pandas Series

for i in s:
    print(i)
print('\n')
for k,v in s.items():
    print(k,v)
print('\n')

100
200
300
400
500
600


v1 100
v2 200
v3 300
v4 400
v5 500
v6 600

In [86]:
# Pandas DataFrame
# it is used to display the information in a tabular fashion
# Pandas DataFrame is 2D Array

data = {
    'Name':['Roy','Jia','Peja'],
    'Age':[23,21,22],
    'Course':['IT','TR','CE']
}
print(data)

{'Name': ['Roy', 'Jia', 'Peja'], 'Age': [23, 21, 22], 'Course': ['IT', 'TR', 'CE']}

In [87]:
df = pd.DataFrame(data)
df

   Name  Age Course
0   Roy   23     IT
1   Jia   21     TR
2  Peja   22     CE

In [88]:
print(df)
print(df.shape)

   Name  Age Course
0   Roy   23     IT
1   Jia   21     TR
2  Peja   22     CE
(3, 3)

In [89]:
data = {
    'Calories':[400,280,500],
    'Time':[32,20,45]
}

df = pd.DataFrame(data,index=['Day 1','Day 2','Day 3'])
df

       Calories  Time
Day 1       400    32
Day 2       280    20
Day 3       500    45

In [97]:
df['Calories']

Day 1    400
Day 2    280
Day 3    500
Name: Calories, dtype: int64

In [95]:
print(df['Calories'].values)

[400 280 500]

In [101]:
df.loc['Day 1']

       Calories  Time
Day 1       400    32

In [103]:
df.loc[['Day 1','Day 3']]

       Calories  Time
Day 1       400    32
Day 3       500    45

In [ ]:
# Using Pandas To Deal With Diff Diff File Formats
# Read an excel file
# Read an csv file
# Read a txt file
# Read json file
# Upload Local Files
# Read a sql file

In [108]:
# Excell
# read_excel()

data = pd.read_excel('https://raw.githubusercontent.com/yash240990/Python/master/sampleExcelData.xlsx')
data

,id,first_name,last_name,email,gender,ip_address
0,1,Merle,Draisey,mdraisey0@squarespace.com,Bigender,20.70.199.51
1,2,Casey,Sheach,csheach1@deviantart.com,Male,226.126.229.167
2,3,Darya,Leivers,dleivers2@imgur.com,Female,247.209.88.235
3,4,Fancie,Casebourne,fcasebourne3@g.co,Female,172.34.162.239
4,5,Jenilee,Vsanelli,jvsanelli4@fc2.com,Female,200.104.246.2
...,...,...,...,...,...,...
995,996,Lutero,Yurov,lyurovrn@un.org,Male,95.146.16.187
996,997,Verla,Peery,vpeeryro@com.com,Female,172.90.253.234
997,998,Fran,Langran,flangranrp@ft.com,Male,123.179.99.154
998,999,Gabbi,Cummins,gcumminsrq@jugem.jp,Female,190.13.174.159
999,1000,Gloriane,Marc,gmarcrr@businessweek.com,Female,139.87.192.32

In [109]:
# Excel File
# In order to obtain data from the same file but a different sheet

datatwo = pd.ExcelFile('https://raw.githubusercontent.com/yash240990/Python/master/sampleExcelData.xlsx')
datatwo.sheet_names

['data', 'Sheet2']

In [111]:
data = pd.read_excel(datatwo,'Sheet2')
data

   first_name    last_name                                 email
0       Merle      Draisey             mdraisey0@squarespace.com
1       Casey       Sheach               csheach1@deviantart.com
2       Darya      Leivers                   dleivers2@imgur.com
3      Fancie   Casebourne                     fcasebourne3@g.co
4     Jenilee     Vsanelli                    jvsanelli4@fc2.com
5    Charmian    Drinkhall       cdrinkhall5@theglobeandmail.com
6     Janessa       Kivell                 jkivell6@linkedin.com
7       Mirna       Heinsh                  mheinsh7@spotify.com
8       Darby          Lax                   dlax8@people.com.cn
9       Meryl        Riehm                 mriehm9@princeton.edu
10       Anne        Brody                    abrodya@sphinn.com
11       Puff    Langsbury             plangsburyb@canalblog.com
12       Tina      Gregoli                  tgregolic@sfgate.com
13     Barbie       Dahlen                     bdahlend@narod.ru
14     Andeee  Dobrovolski  adobrovolskie@networkadvertising.org
15    Ainsley       Friman                      afrimanf@irs.gov
16        Bil     Shalcros                 bshalcrosg@dion.ne.jp
17    Raimund     Outridge                   routridgeh@lulu.com
18     Whitby     Millward                    wmillwardi@ask.com
19        Rob      Boarder                       rboarderj@51.la
20      Nicky     Curthoys                    ncurthoysk@pbs.org

In [112]:
# CSV ---->comma seperated values
# read_csv()

data = pd.read_csv('https://raw.githubusercontent.com/yash240990/Python/master/Position_Salaries.csv')
data

            Position  Level   Salary
0   Business Analyst      1    45000
1  Junior Consultant      2    50000
2  Senior Consultant      3    60000
3            Manager      4    80000
4    Country Manager      5   110000
5     Region Manager      6   150000
6            Partner      7   200000
7     Senior Partner      8   300000
8            C-level      9   500000
9                CEO     10  1000000

In [114]:
# text file 
# read_csv()

iris = pd.read_csv('https://raw.githubusercontent.com/yashy1626/ds_dataset/refs/heads/main/iris.txt', sep='\t')
iris

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [120]:
# json file 
# read_json()

data = pd.read_json('https://raw.githubusercontent.com/yash240990/Python/master/simple.json')
data

     id   name  math  physics  chemistry
0  A001    Tom    60       66         61
1  A002  James    89       76         51
2  A003  Jenny    79       90         78

In [129]:
print(data['name'].values)

['Tom' 'James' 'Jenny']

In [131]:
# Uploading Local Files

data = pd.read_csv('MOCK_DATA.csv')
data

,id,first_name,last_name,email,gender,department,salary
0,1,Lennard,Danher,ldanher0@bloglines.com,Male,Training,9089
1,2,Sophia,Reeman,sreeman1@soup.io,Female,Sales,4745
2,3,Allegra,Copelli,acopelli2@ycombinator.com,Female,Services,9916
3,4,Faith,Stockney,fstockney3@sciencedirect.com,Female,Product Management,7244
4,5,Mercie,Caldeyroux,mcaldeyroux4@discuz.net,Female,Human Resources,9205
...,...,...,...,...,...,...,...
995,996,Lindi,Hedgecock,lhedgecockrn@reverbnation.com,Female,Business Development,8764
996,997,Philomena,Tumpane,ptumpanero@soup.io,Female,Legal,6715
997,998,Vladamir,Kielt,vkieltrp@angelfire.com,Male,Human Resources,3618
998,999,Jdavie,Wasiela,jwasielarq@typepad.com,Male,Marketing,9842
999,1000,Denyse,Willisch,dwillischrr@virginia.edu,Female,Legal,7442